{"title":{"0":"Codeup Dallas Open House","1":"Codeup’s Placement Team Continues Setting Records","2":"IT Certifications 101: Why They Matter, and Why They Don’t","3":"A rise in cyber attacks means opportunities for veterans in San Antonio","4":"Use your GI Bill® benefits to Land a Job in Tech","5":"Which program is right for me: Cyber Security or Systems Engineering?","6":"What the Heck is System Engineering?","7":"From Speech Pathology to Business Intelligence","8":"Boris – Behind the Billboards","9":"Is Codeup the Best Bootcamp in San Antonio…or the World?","10":"Codeup Launches First Podcast: Hire Tech","11":"Why Should I Become a System Administrator?","12":"Announcing our Candidacy for Accreditation!","13":"Codeup Takes Over More of the Historic Vogue Building","14":"Inclusion at Codeup During Pride Month (and Always)"},"published":{"0":"Nov 30, 2021","1":"Nov 19, 2021","2":"Nov 18, 2021","3":"Nov 17, 2021","4":"Nov 4, 2021","5":"Oct 28, 2021","6":"Oct 21, 2021","7":"Oct 18, 2021","8":"Oct 3, 2021","9":"Sep 16, 2021","10":"Aug 25, 2021","11":"Aug 23, 2021","12":"Jun 30, 2021","13":"Jun 21, 2021","14":"Jun 4, 2021"},"content":{"0":"Come join us for the re-opening of our Dallas Campus with some drinks and snacks at Codeup! Curious about what our campus looks like? Click here to register for free\nAbout this event\nCome join us for the re-opening of our Dallas Campus with some drinks and snacks at Codeup!\nCurious about what our campus looks like? Interested in our Web Development Career Accelerator? Keen to chat with an instructor or financial aid rep?\nAt our Open House, we are here to answer all your questions!\nMeet a Codeup instructor, who can help explain what’s taught in our classes and answer questions.\nUnderstand how to join one of our upcoming cohort ( Dec. 6th).\nDon’t miss this opportunity to learn more about how you can start the new year transitioning into a new, exciting career in tech. We’re here to answer any questions you may have about Codeup and your future.\nTake the first step of your new career today and create your tomorrow!","1":"Our Placement Team is simply defined as a group that manages relationships with our employer partners and our graduating students to help get our graduating students hired. Last quarter the Placement Team helped 48 students get hired to life-changing careers in tech. Last month our Placement Team has already placed 40 students with top tech companies. For that, we want to send a huge thank you to both our Placement Team and our Employer Partners who have done a tremendous job of helping Codeup empower life change for these students.\nWho exactly got hired and where? Check out the list below!\n\n\nKirsten Collier – hired at CGI as a Java Developer\nMichael Baker – hired to CGI as a Java Developer\nMichael Troia – hired to CDW as an Associate Consulting Engineer \nCarlos Padilla – hired at CGI as a Java Developer \nVictor G. Hernandez – hired at Anderson Marketing Group as a Java Developer\nNicholas Martinez – hired at Seggazza as a Software Engineer \nJordan Felan – hired at Seggazza as a Software Engineer\nSavannah Garcia – hired at CGI as a Java Developer\nRicardo Figueroa – hired at CGI as a Java Developer\nDemetrio Tovar – hired at CGI as a Java Developer\nRaul Martinez – hired at CGI as a Java Developer\nPrachi Phatak – hired at Olo as a Software Engineer II \nJesse Sosa-Leffew – hired at CGI as a Java Developer\nAmado Azua – hired at CGI as a Java Developer\nGrady Griffin – hired at Howard.pro as a Software Developer\nStephen Nguyen – hired at Silotech Group as an Associate Software Developer\nJoshua Borreli – hired at Silotech Group as an Associate Software Developer\nErik Ayalasga – hired at Accenture Federal as a Java Developer \nChristopher Espinoza –  hired at Silotech Group as an Associate Software Developer\nCorey Shaw – hired at CGI as a Java Developer\nSamuel Bowcut – hired at Silotech Group as an Associate Software Developer\nSean Lewis – hired at Accenture Federal as a Software Engineering Associate \nRobert Sledge – hired at Accenture Federal as a Software Engineering Associate\nMatthew Walker – hired at Accenture Federal as a Software Engineering Associate \nMatthew Dalton – hired at Oracle as an APEX Developer\nDustin Martinez – hired at Accenture Federal as a Software Engineering Associate \nKelvon Pointer-Patterson – hired at Accenture Federal as a Java Developer Associate \nKenyon Luce – hired at Accenture Federal as a Java Developer Associate\nJuan Garcia – hired at Accenture Federal as a Software Engineering Associate \nAlexander Hernando-Avitia – hired at Accenture Federal as a Software Engineering Associate \nJohn Pierce – hired at Accenture Federal as a Software Engineering Associate \nDavid Wagnon – hired at Social Solutions as an Associate Software Engineer\nEvan Williams – hired at Social Solutions as an Associate Software Engineer\nRose Barcus – hired at Accenture Federal as a Software Engineering Associate\nDavid Culver – hired at Accenture Federal as a Software Engineering Associate\nAustin Whitley – hired at Accenture Federal as a Software Engineering Associate\nAnna Vu – hired at Sparrow Partners as a Data Scientist \nRoberty Murphy – hired at Lone Star Analysis as an Analysis Professional \nCindy Villanueva – hired at Colorado Community Managed Care Network as a Data Engineer \nMotchell Higue – hired at USAA as a Full Stack Developer\n\n\n\n\nCurious what it’s like to hire a Codeup graduate? Check out our hiring process here.\nWant to land a life changing career like these students did? Check our list of programs offered here.","2":"AWS, Google, Azure, Red Hat, CompTIA…these are big names in IT! And not only for their products, but also for the certifications they offer. If you’re new to tech, you might be wondering: Do certifications really matter? Welcome to IT Certifications 101! What’s the tl;dr? Certifications are critical to getting past HR for certain roles, but they won’t get you the job.\nWhat are IT Certifications?\nCertifications are official credentials given by companies, institutions, and vendors to verify that you have demonstrated a specific knowledge or skill. They are a stamp of approval from a known brand (like Amazon) saying “This person knows their stuff.” Certs are used in a lot of industries, including technology. Even within tech, there are dozens of vendors and hundreds of certs.\nWhy do IT Certifications matter to employers?\nMany roles (including security, system administration, and networking) require certain certs to make it in the door of an interview process. This filter matters for several reasons: it helps narrow down the pool of applicants, it establishes a baseline of shared knowledge or experience across all applicants, and it expedites the process so that employers don’t have to spend as much time vetting basic technical skills.\n\n\n\n\n\nWhy do they matter to you?\nObtaining certs in IT will provide you with a number of benefits:\n\nYou will show up in recruiter searches on LinkedIn!\nYou can follow specific, concrete paths for your career development\nYou obtain industry-recognized, respected, and transferable credentials relevant for your whole career\nYou develop relevant and broad-base content knowledge\nYou will be able to pass initial HR screenings and land a seat in the interview\n\nWhy DON’T they matter to employers and you?\nAt the end of the day, certifications are just pieces of paper. They represent your ability to pass a test, not to do a job. Sometimes those things are one and the same, but usually, they are very different. Certifications are like the entrance fee to get into a tournament: you still need to fight your way to the top. And when you’re standing in the ring, it’s better to know how to fight than to have a degree in fighting.\nAdditionally, not all jobs within tech care about certifications at all. For example, there is technically a Java programming certification from Oracle, but it’s almost never required or considered for job applications because it tests very specific, abnormal, and academic concepts that don’t apply to most real-world software development.\nIf Certs matter AND don’t matter, what do I do?\nAt Codeup, we like to think of our IT training as CertificationsPLUS, as in – you get certifications PLUS hands-on experience. Here’s a quick way to think about it: Amazon Web Services has basic certifications called Cloud Practitioner and Solutions Architect Associate. The official Amazon training for these certs is 1 week: 4 days of training and 1 day of exam readiness. The 1-week schedule will present to you mostly everything you need to pass the certification exam, and then it’s on you to go cram and memorize to get ready. Once you pass, you’ll have the cert, but you’ll be a paper tiger: all bark and no bite. In other words, you’ll appear knowledgeable and skillful on paper, but in reality, you won’t have any experience or know-how for completing the real work.\nAlternatively, Codeup spends 5 weeks on AWS, combining exam study and hands-on practice. That way, you can talk the talk and walk the walk.\nIf you want to learn more about IT certification and training paths, reach out to us at info@codeup.com!","3":"In the last few months, the US has experienced dozens of major cyberattacks against leading organizations like Accenture, the NBA, and Kia Motors. Similar attacks are on the rise. This year, 38% more companies have experienced cyber attacks as compared to last year. Often, they involve a ransom payment in order to re-access stolen files. The amount paid by these victims has increased by 300%. In our headquarters of San Antonio, Texas, even local organizations are at risk. Recently, Judson ISD paid a $500,000 ransom.\nIn 2020, there were over 300,000 open roles for cybersecurity professionals in the US. To add to that, the US Bureau of Labor Statistics predicts a 31% increase in Information Security roles in the upcoming years. As attacks are on the rise, the demand for cybersecurity professionals is quickly increasing. But with so many open roles, the issue isn’t demand – it’s supply.\nLuckily, San Antonio is already a national leader in cybersecurity. We have over 16,000 employees in the field, which is the most certified cyber professionals outside of D.C.. With industry giants like USAA and Lockheed Martin in the city, we have a good footing over much of the country. Moreover, San Antonio is Military City, USA. We’re home to one of the largest populations of bases, veterans, and active service members in the country. With both these backgrounds, the city is well-positioned to continue to lead our country’s defense – not just traditionally, but in cyber warfare as well. \nBut we still need more help. What can we do about it? Train more cybersecurity professionals. Organizations like Project Quest have supported cybersecurity training for years. But we can’t rely solely on non-profit funding. There are plenty of opportunities for veterans to enter the field with VA benefits. Training programs like Codeup Cloud Academy are approved to accept GI Bill® and Vocational Rehab. This allows veterans to receive housing support while getting the cybersecurity training they need in our Cyber Cloud program.\nWant to keep San Antonio safe and positioned as a leader in Cybersecurity? Help us train the next generation of cybersecurity professionals! Connect us with veterans in your network so we can all help continue San Antonio’s tradition of protecting our city and country!","4":"As the end of military service gets closer, many transitioning service members often ask, “Can the GI Bill® pay for a coding bootcamp?” The answer is yes, but only if the coding bootcamp is on the VA-approved list.\nThe GI Bill® will pay for college or a VA-approved coding bootcamp. For bootcamp programs, the VA uses a formula to calculate how much time to deduct from your benefits based on the program’s tuition and how it compares to average college costs.\nThat’s good news for veterans looking for a second career in the technology sector. The tech industry is fast-paced, action-oriented, and often focused on completing small goals to accomplish large ones, a familiar process for those trained by the military. With average salaries for entry-level programmers averaging around $80,000, it’s a great time to learn how to code and get paid for your expertise.\nWhy attend a coding bootcamp instead of college?\nYou could always attend a two- or four-year college degree program in computer science and learn software development. Or you could train for these jobs by completing a specialized bootcamp program.\nCoding bootcamps teach widely used programming languages and frameworks like Ruby on Rails, Python on Django, JavaScript, and PHP stacks through project-based learning. Students graduate from bootcamps with a portfolio, an online presence, interview skills, and more. Most courses even help graduates find an internship or match students with an employer network.\nA bootcamp is an immersive, intense full-time learning environment. Students should prepare to scale back outside activities and give up full-time employment for the program’s course. Coding bootcamps vary in length from six to 28 weeks, although the average time is about 14 weeks long. Military service members transitioning from active duty to veteran status can often leverage terminal leave to attend a coding bootcamp.\nIf you’re still wondering whether to choose a college program or a tech career accelerator, here are some points to consider:\n\nCollege isn’t for everyone. You may not have the time or money for four years of study or aren’t interested in all the extras that come with college life.\nGI Bill® education benefits can pay for tuition, housing, and other associated costs of attending an approved bootcamp, much like when you attend college.\nInterviewers for coding and developer jobs evaluate you on practical skills and experience, not your academic performance. Many bootcamps feature a Capstone project, in-depth work to solve a problem that becomes part of your portfolio so you can show potential employers what you can do.\nMany bootcamps have job placement programs to help you find an internship or land a job after graduation.\nIn some cases, bootcamp programs will offer a job guarantee within a certain amount of time after graduation, or they will refund your tuition costs.\n\nWhat should veterans look for in a Bootcamp?\nA tech workforce development program usually translates into extensive, hands-on instruction in say, learning how to write code in less time than it takes to complete a two- or four-year degree program. Some bootcamps may be offered through established state or private universities, while some private providers offer training programs.\nWhat should you look for in a bootcamp?\n\nThe bootcamp should meet the criteria as a VA-approved institution. Some coding schools may have only some programs that are GI Bill® eligible, but not others.\nBootcamps typically can adapt to changes in the tech industry faster than a college. Ask if the curriculum incorporates feedback from industry partners and is updated to teach the latest practices.\nCoding bootcamps should be training students in practical skills. Will you get to work with a client or organization on a project? See if the program you’re interested in offers a Capstone project or an internship as part of the curriculum.\nA successful bootcamp ensures its students get the jobs they are trained to do, so check on job placement resources and guarantees. Resume help, interview training, and a robust network of industry partners interested in hiring graduates means better chances of getting that sought-after tech job.\nA school offering a tuition refund guarantee is aligning its business incentives with the interests of its students. If students aren’t successful, then neither is the school. Look for a tuition policy that either defers tuition payment until employed in a qualified position or guarantees a refund should a student fail to land a tech job within a specific timeframe.\n\nIf you’re a veteran in Texas, Codeup offers GI Bill® eligible programs\nTexas-based Codeup offers accelerated programs in San Antonio, Austin, Dallas, and Houston to help you launch your tech career. No previous experience is needed to participate in any of Codeup’s accelerator programs, all of which are GI Bill® eligible.\nApply to Codeup’s full-stack web development to learn how to create an app or website from start to finish using today’s coding languages in just 20 weeks.Apply to Codeup’s systems engineering bootcamp if you’re up for problem-solving in information technology in this 13-week accelerator.Apply to Codeup’s data science bootcamp if you’d like to be a data scientist and learn how to apply machine learning models to make predictions and turn your insights into actionable recommendations over the course of 20 weeks.\nYou’ll also get professional job application counseling and support as an ongoing part of our curriculum, which continues even after graduation. Veterans and their dependents may also apply for a Codeup scholarship to offset the amount of VA benefits used for tuition.\nCodeup’s job guarantee means you’ll get hired for a tech job you’ve trained for within six months of graduating or receive a refund of 100% of your tuition.\nFor more information on Codeup’s GI Bill® eligible bootcamp programs, reach out to one of our admissions specialists for more details or call us at 210-802-7289.\nContributing Author Iris Gonzalez.","5":"What IT Career should I choose?\nIf you’re thinking about a career in IT, there are a lot of directions you could go. You could become a web developer or data scientist or study UI\/UX and graphic design. Or for those of you reading right now, you might be looking at entering a career in networking, cybersecurity, or cloud administration. Which might lead you to ask: what’s the difference, and which program is right for me?\nBoth these programs are 13-weeks long. While they have different names, they share a lot of similar content as entry-level IT accelerators. Of the seven technical modules, four of them are shared. Both cover:\n\nNetworking – Gain in-depth exposure to networks and topics across the OSI model,  networks, protocols, and packet Capture, network analysis, and more.\nLinux – Gain exposure and get hands-on configuring and maintaining the Linux operating system.\nWindows – Exposure to the Windows Server 2012 R2 Operating System to learn server management functions using Server Manager and basic command-line utilities and tools to run from the command prompt.\nAWS – Become familiar with key industry terms and concepts while building a foundation of cloud product knowledge across Amazon Web Services.\n\nNetworking, Linux, Windows, and AWS are a LOT of content for new IT employees. Outside of this content, the programs split into their areas of focus:\n\nCyber Cloud gets students certified in Security+ and AWS\nSystems Engineering gets students certified in Network+ and Linux+\n\nNow that you understand where the programs are similar and where they differ, which one is right for you? Here are some questions to consider:\n\nDo I have any technical work experience?\nDo I have any training or education in IT?\nDo you prefer solving open-ended and ambiguous problems, or concrete problems with solutions?\nAre you interested in building and developing systems, or in securing and protecting systems?\n\nIf you don’t have any work or education in IT, the Systems Engineering program is the one for you. It is designed to be the 0-1 step in your IT career to get you started! If you do have work experience or education in IT, then you might be interested in Cyber Cloud. Why is that?\nOur programs focus on CompTIA certifications, which is a major industry provider in technical training. The typical track through their IT certifications is to start with their A+, then complete their Network +, and then progress to their Security +. That means if you don’t have your Network + (or relevant experience), it can be really hard to catch up.\nStill not sure which is right for you? Try it out for yourself with this free Network Fundamentals Crash Course. Ready to get some questions answered? Request More Information Here","6":"Codeup offers a 13-week training program: Systems Engineering. Designed to help you launch your career in tech, this program takes you from 0 experience to IT hero with certifications and hands-on experience in just weeks. But if you’re new to tech, you might be wondering…what is Systems Engineering?\nWhat is Systems Engineering?\nIn IT terms, a Systems Engineer (Sysadmin or Sysad for short) is responsible for the configuration, upkeep, and operation of computer systems. They manage things like security, storage, automation, troubleshooting, and a whole lot more. For example, some of the day to day tasks include things like:\n\nReviewing system logs for anomalies and issues\nUpdating operating systems (OS)\nInstalling new hardware and software\nManaging user accounts\nDocumenting information about the system setup\nManaging file systems\n\nYou might be thinking, “Woah, that looks like a lot!” and that’s because it is! A Systems Engineer is a critical piece of IT infrastructure. And in today’s digital age, all companies are IT companies, which means Sysadmins are critical everywhere. You can think of a Sysad as a jack-of-all-trades of what we typically think of as IT. But don’t forget how the old saying actually ends: “A jack of all trades is a master of none, but oftentimes better than a master of none.” So, what are the skills a Sysadmin uses?\n\nNetworking – Networking skills include how to configure, maintain, and troubleshoot networks, including using hardware like switches, routers, and firewalls. These skills and concepts are crucial to any systems engineering position. You not only need to understand them but also need some way to prove it. With the Network+ certification, job seekers can come to employers with proof of their networking know-how.\nLinux- Linux is one of the most popular Operating Systems (OS). It is fully compatible with Mac OS and underpins all Android systems. In fact, the world’s IT infrastructure is run primarily on Linux. Certifications are the primary way technical folks prove their skills and Linux is no different. The CompTIA Linux+ certification is an entry-level certification that proves knowledge and basic technical proficiency in the job role\nCloud – This involves using servers and tools (i.e. processing and storage hardware) that are based in a different location, instead of on-site. Our program introduces students to cloud concepts like storage, computing, permissions, and more!\n\nWhy Become a Systems Engineer?\nNow you know what a Sysadmin does and what skills they use. But why become a Sysadmin? The world is increasingly dependent on computer systems and their underlying technologies. Configuring computer software, designing innovative solutions for specific problems, and basic troubleshooting skills are more and more in demand each year.  Without systems engineers, the technical world would stop innovating and become stagnant.\n\nThey are in demand! Companies rely on Sysadmins to keep all their IT running\nYou’ll become a tech guru! You won’t just be the person who can fix the printer. You’ll also be the person who can script, work with servers, navigate AWS Cloud tools, and work on modern web technologies.\nYou can specialize! With the breadth of knowledge you’ll obtain, you can have a specialized career in IT. Just hone in on one of your interests, whether it’s security, cloud, databases, or something that doesn’t even exist yet!\n\nInterested in learning more? Sign up for our Network Fundamentals Crash Course to get a taste for these skills – a $500 value you can get for free!Ready to go all-in? Apply to our 13-week Systems Engineering program where you’ll earn your Network+ and Linux+ certifications, along with skills in AWS, LAMP, Microsoft, and more!","7":"By: Alicia Gonzalez\nBefore Codeup, I was a home health Speech-Language Pathologist Assistant. I would go from home to home working with children anywhere from 1 year old to 18 years old. After 5 years of the profession, my body was getting tired driving around all the time and I felt overworked. The work was satisfying and I do miss working with the kiddos, but I just felt drained. I knew it was time to find a different field, so I started thinking about what else I was good at.\nThen one day as I was on my way to a patient’s home, I found a Codeup billboard near Splashtown that said “drive to a job you love” and I took it as a sign. I thought, “I want to drive to a job I love!” I had also heard nothing but good things about Codeup from a friend that went the Web Development route. She answered my questions and helped me through the whole process.\nAt first, I was a little worried about tuition payment, but once I got started in the application process, they held Zoom meetings where they would talk about all the funding options. They made it really easy and addressed all of my concerns. I realized I didn’t have to be scared about the financial aspect. I applied to a couple of grants and was able to get about a third of my tuition covered through the Train for Jobs SA grant from Workforce Solutions Alamo. That really helped me. I also received a few different scholarships from Codeup. The rest of it was a loan from Meritize.\nIt was difficult leaving something I was comfortable and familiar with to start something new with no data science background, but I have always enjoyed all things tech. Once we got into the pre-assessment work and then the prework leading up to class, it showed me, “okay this IS what I wanted to be doing.” I really enjoyed it, thought it was fun, and realized this was for me.\nOverall, I really enjoyed the program. We were in Zoom the whole time because of the pandemic, but they made it slow, nice, and easy. The instructors are absolutely wonderful. Every single instructor helped me at one point or another, teaching things from ground zero and explaining everything really nicely in a way I can understand. One thing I value the most about the instructors is that, not only do they go over all the necessary skills needed in a data-related career, but they teach us how to learn the skills as well. They didn’t just give us the work and tell us exactly how to do it. They provide instruction, hands-on exercises\/projects, and answers to all questions, but most importantly, they walk us through how to work with the data and obtain the answers on our own. This is extremely valuable as I believe it is the key to success in this field.\nNow after graduating from Codeup, I’m a Business Intelligence Analyst at Liquid Web. I’ve been here almost three months now and I’m contributing to so many projects. I really feel like a true member of the team. I can figure things out for myself and my bosses are telling me how well I’m doing and how far I’ve come since working here. I didn’t have to ask for much help or training, because Codeup prepared me well and taught me how to learn when I run into skills they don’t teach. It’s been really good.\nI’m so glad I made this change. It was scary to take that leap of faith, but ultimately, I’m really glad I did. I love my job and I love what I’m doing. If anyone is looking to make a career change and struggling to find their best fit, I recommend looking into Codeup and going through their process. I’m extremely happy where I am right now and wouldn’t change a thing.","8":"","9":"Looking for the best data science bootcamp in the world? Or how about the best coding bootcamp in San Antonio? If you’re reading this, you’ve found both! We are thrilled to announce that Codeup has been chosen as a Best Data Science Bootcamp of 2021 by Course Report, and a Best San Antonio Coding Bootcamp 2021 by Career Karma.\nBest Data Science Bootcamp in the World\nCourse Report is a leading authority in ranking and reviewing bootcamps. Every year, they compile a list of the Best Data Science Bootcamps in the world. Codeup made the 2021 list, along with 21 other bootcamps, for our Data Science program. Why? Course Report considers alumni and student reviews, financing options, outcome transparency, and duration of the program. More on how Codeup performs in each of those categories below!\nBest Coding Bootcamp in San Antonio\nThe folks at Career Karma are experts on what the best bootcamps are for various tech careers. They’ve recently identified the 10 Best Coding Bootcamps in San Antonio in 2021 with Codeup in the top 5 for our Web Development program. Also on the list is Open Cloud Academy, which is now Codeup Cloud Academy (CCA), owned and operated by us. The CCA programs recognized are cybersecurity and Systems Engineering.\nWhy Codeup?\nHere are a few reasons why Codeup is one of the best bootcamps in San Antonio and the world:\n　　• Students and alumni gave an average rating of 4.69 stars on Course Report　　• 6 financing partners believe in our program so much that they offer aid to our students, including VA benefits for our veterans　　• Data Science grads earn a median starting salary of about $70,000 with high placement rates 　　• Web Development grads earn a median starting salary that’s above the local, state, and nationwide averages for entry-level developers at about $45,500　　• The intensive programs need 22 weeks (5-6 months) to cover a robust curriculum that’s catered to employers　　• The instructors have decades of prior industry experience and are invested in each student’s learning and success\nThese awards are huge for the security and confidence they provide our students and employer partners. If you’re an employer looking to hire from the best bootcamp, now you know where to find high-quality talent. If you’re interested in a career change into tech, now you know where to apply to get the best experience. \nSpecial shoutouts are in order to every single person on our incredible staff. It is an honor to be recognized not just locally, but globally! If you’d like to work at an award-winning institution, now you know where you can join a well-oiled machine and make a huge impact. We’re hiring!","10":"Any podcast enthusiasts out there? We are pleased to announce the release of Codeup’s first podcast, Hire Tech! Hire Tech is a conversation with new developers and the people that hire them, hosted by our CEO and Co-Founder, Jason Straughan. \nIn a world where “entry-level” positions often require 3 years of experience, Jason sets out to discover what it’s like to break into and work in the modern tech industry. To hear various perspectives, he interviews both Codeup alumni and tech leaders who have hired from Codeup. These stories show you the impact Codeup has on the tech world by empowering our community with real life change.\nIn the first episode, Jason interviews Codeup alum Ryan Smith, who has been working as a Software Developer and Software Engineer for nearly two years. From a missionary in Colombia to a Dog Handler in Afghanistan, Ryan’s life experiences are one of the many ways he and other Codeup grads stand out to employers. That, paired with his interview preparation trick. Listen in to learn what it is!\nThis episode will reveal how he went into his job search with total confidence, what he would tell hiring managers regarding junior-level talent, and why they shouldn’t get caught up on an applicant not knowing their primary language. Give it a listen on Spotify. Also available on Apple Podcasts, Anchor, and Google Podcasts, it’s perfect for your morning commute!","11":"With so many tech careers in demand, why choose system administration? System administrators are a key component of their organizations. They keep the technology working smoothly and interact with people all across the company. Are you interested in understanding how computers operate? Or are you curious about tech but unsure of what specific tech career you might want? If so, read on to learn why you should become a system administrator!\n\n\n\n\nBe a Tech Wiz\n\n\nA system administrator has a solid foundation of the building blocks of technology. Usually, full-time employees are responsible for the upkeep, configuration, and troubleshooting of computer systems. They know the ins and outs of networking, operating systems, web servers, and databases. This is a great career path if:\n\n\n\n\n\n You want to thoroughly understand how computers operate throughout a long-term career\nYou are interested in tech, but want exposure to various subjects before fully pursuing one thing\n\n\nRequest More Information\n\nAs an almost catch-all position for all things tech, you’ll get exposure to the business and analytics side of tech, computer science, technology management, infrastructure, hardware, and software. All of this variety will help you choose a specialization within system administration or even an entirely different tech career.\n\n\n\n\nGet Started with No Experience\n\n\nTo learn the skills required for the job, you often need to get certifications including CompTIA Network+ and Comp TIA Linux+. Thankfully, you can train for these certifications at programs like Codeup Cloud Academy with no prior experience needed. These sorts of programs provide critical hands-on practice so that you’re job-ready once you have the certifications in hand. Alumni often start out in Help Desk and Tech Support roles and quickly move up to become the System Administrator.\n\n\n\n\nA Skillset More and More Companies Rely On\n\n\nCompanies depend heavily on their computer networks and need them to be fast, reliable, and updated. As more and more companies depend on and invest in technology, more and more will rely on system administrators for this upkeep. The U.S. Bureau of Labor Statistics projects the employment of systems administrators to grow 4 percent from 2019 to 2029. It states:\n\n\n\n\n“Demand for information technology (IT) workers is high and should continue to grow as firms invest in newer, faster technology and mobile networks.”\n\nU.S. Bureau of Labor Statistics\n\n\nOur home base of Texas is actually the state that employs the most system administrators, with 34,410 currently employed.\n\n\n\n\nStart a Salaried Career\n\n\nReady to transition from a personally or physically taxing job to a full-time office job with benefits? Rather than working odd hours, finding people to take your shift, or working for commission, this career path will provide a solid and reliable salary with traditional office hours that allow for a great work\/life balance.\n\n\n\nAccording to salary.com, the average salary of System Administrators in the United States is $67,448. This is the average across all levels of seniority, but of course, salaries range based on experience and location. These are the average salary ranges of System Administrators citywide, statewide, and nationally:\n\n\n\n\n\nSan Antonio (our headquarters): $58,094 to $74,660\nTexas: $58,665 to $75,394\nUnited States: $59,743 to $76,779\n\nYou’re a People Person and Problem-Solver\n\n\nIn this career, you’ll interact with people at all levels of the organization and will need to simply explain complex topics. Good communication skills are a must! You should enjoy working with others and have great customer service skills. In addition, you’ll need to problem solve, think critically, and think quickly. When a network is down on a high-stakes day, it’s your time to shine, but you’ll need to withstand the pressure and act fast.\n\n\n\nReady to earn a reliable salary, use your people skills, and get a skillset that many companies rely on? It only takes a few months to start your new IT career. Get the certification training and hands-on experience you need to launch your career in system administration. Start here.","12":"Did you know that even though we’re an independent school, we have multiple regulating bodies that verify our processes and results? For starters, we’re licensed and regulated by the Texas Workforce Commission. We’re also approved by the SAA Texas Veterans Commission to accept VA Benefits, and audited by the Council for Integrity in Results Reporting. This already gives us a premier status and a trusted brand name. But there’s one missing piece that would take us to the next level: an accrediting body. Now, we’re well on our way there! We are proud to announce that, effective May 2021,  Codeup is a Candidate for Accreditation by The Middle States Association Commission on Secondary Schools (MSA-CSS), which is located at 3624 Market Street, Philadelphia, PA 19104 (Phone: 267-284-5000).\nWhat does this mean?\nAccrediting bodies provide guidance and best practices for institutions like Codeup, and verify the quality of our education. The MSA-CSS in particular is recognized by the U.S. Secretary of Education. Getting accredited by them would allow us to establish eligibility to participate in federal Title IV student loan programs for adult students. This could be huge for our applicants, as it would significantly expand access to financial aid and allow even more people to change their lives by launching a tech career at Codeup. We would also be the first and only career accelerator with MSA-CSS accreditation in Texas. One article even states that coding bootcamps, in general, are not accredited.\nWhen will this happen?\nCurrently, we are a candidate for accreditation, and not yet accredited. (Establishing candidacy is in itself a big feat, and a little bird told us our application was in the top 1% over at least the last 15 years!) Now that we’re candidates, we are actively working with the MSA-CSS to meet or exceed the requirements for accreditation. This process usually takes 18-24 months. Once approved, it would be an additional 12-18 months for Title IV acceptance, which is what would enable students to receive federal loans.\nAs the Premier Career Accelerator in Texas, we are thrilled about this news. Adding this layer of compliance and quality assurance will significantly improve the quality of education we provide and the way that we provide it. It will help us abide by our core values of Delivering Excellence, Acting with Integrity, Cultivating Inclusive Growth, and Being Helpful. It will help us live out our mission of empowering life change on a bigger and better scale, so that we can continue to be the #1 option for Texans looking to launch a career in tech!\nNot familiar with Codeup? Get to know our core values, mission, and all about us.Curious about our verified results? Check out our CIRR and TWC outcome reports.","13":"Codeup is moving into another floor of our Historic Vogue building in Downtown San Antonio! We’ve gone from a humble beginning in the middle of a coworking space called Geekdom, to now having three floors of our own in our favorite downtown building.\nWhy San Antonio?\nCodeup has a campus in Dallas, classrooms in the Rackspace Castle in San Antonio, and offices in Houston and Austin. But Downtown San Antonio is where we were born and raised, and where we’ve planted our flag for our headquarters. While other Texas cities are becoming known for tech, San Antonio never has been. This is the city where we can make the biggest impact on the local tech scene. We’re supplying companies with the in-demand tech talent that has been missing locally while changing lives by launching San Antonians into these tech careers. \nWhy the Vogue Building?\nThe SA Tech District is growing downtown and the historic Vogue building is in the heart of it all! We’ve been part of that action for 7 years and in the Vogue Building for 6 of them. Changing careers is a lot of work, both on our staff and students. We want to have fun while doing it! We need an upbeat atmosphere where we can stay plugged into San Antonio and engaged in the tech scene. Steps away from the Majestic Theater, the Riverwalk, and our old home at Geekdom, our students and staff have a location to be excited about. \nWhy the Expansion?\nDuring the pandemic, our staff doubled in size and we’ve outgrown our two floors. As we invite our staff back to working in-office, they need to be able to fit. By expanding into the second floor, our staff will have breathing room and ample space for social distancing. Our classrooms will stay on the 6th floor, where students get the best views of downtown. \nIf you want to get plugged into the San Antonio tech scene, you’ve got options with Codeup! Launch a career in tech as a web developer, data scientist, system administrator, or cyber cloud specialist. Work in the office with us by joining our staff. Or, hire our grads. Hope to see you at the Vogue someday!","14":"Happy Pride Month! Pride Month is a dedicated time to celebrate and support the LGBTQIA+ community. At Codeup, one of our core values is Cultivating Inclusive Growth, something that takes on many shapes, sizes, forms, and colors. From representation in tech to empowering and supporting all, let’s reflect on how we live out this core value for our LGBTQIA+ community, not just during Pride Month, but always.\nCultivating Inclusive Growth\nWe’re firm believers that the people making tech should look like the people using it, which is everyone. We’re proud to offer Pride Scholarships year round, which aim to increase, support, and promote representation of the LGBTQIA+ community in tech. However, representation is only one part of cultivating inclusive growth. We want to help create a thriving tech community where everyone feels represented, but also safe and empowered.\nIn a 2019 survey conducted by Blind, 83% of LGBQ technologists and 78% of trans or gender non-conforming technologists reported that they felt safe in the workplace. In 2020, those numbers dropped to 76% and 64%, respectively. Why the drop? Maybe recent pushes for representation in tech weren’t followed up with efforts to truly cultivate inclusivity and growth.\nCodeup Initiatives\nTo cultivate inclusive growth, we don’t stop at representation. We also empower and support our community so that no one feels unsafe. Our internal DEI Taskforce empowers our staff with resources and conversations that aim to create a diverse culture of support, safety, and inclusivity for each other and our students. Equipped with this knowledge, our staff can cultivate inclusive growth from the first time they interact with an applicant all the way until they get placed into a new job. They may have even felt empowered just by seeing our students and staff sporting their Pride t-shirts around town. You can get yours on our merch store! The proceeds support our Pride Scholarship.\nNot only do we want the people making tech to look like the people using it, we also want them to feel safe and empowered to do so. If you’re looking for a career in tech, let us empower you every step of the way! First, apply now. Then, apply for our Pride Scholarship."}}