{"title":{"0":"LIC files draft papers with SEBI to seek approval for India's biggest IPO","1":"Piyush Goyal shares meme featuring Shark Tank's Anupam Mittal, he replies","2":"We have lost a visionary: Rahul Gandhi on Rahul Bajaj's demise","3":"I've made multi-billion dollar businesses, it was possible due to honesty: Ashneer Grover","4":"13-yr-old girl gets ₹50 lakh funding on Shark Tank for her anti-bullying app","5":"Bajrang Dal stage protests, put posters at KFC, Hyundai, Kia showrooms in Guj","6":"No visits to duty-free, wear minimum jewellery: Air India in new cabin crew advisory","7":"What is the ₹22,842 cr ABG Shipyard case, biggest bank fraud registered by CBI?","8":"Rahul Bajaj cremated with full state honours, sons Rajiv & Sanjiv perform last rites","9":"Spine of Indian business cracks: Harsh Goenka on Rahul Bajaj's demise","10":"All men die, not all men truly live: Rajiv Bajaj's WhatsApp status after father's demise","11":"Sensex crashes over 1,400 points, Nifty slips below 17,000","12":"Ex-NSE CEO Ramkrishna took advice from unknown 'yogi' on key decisions: SEBI","13":"5G spectrum auction expected to be held in May: Telecom Secretary","14":"No e-comm firm has been found guilty of predatory pricing yet: MoS","15":"Govt extends police modernisation scheme with ₹26,275 crore outlay","16":"LIC's embedded value set at ₹5.39 lakh crore","17":"Multidimensional approach key to achieve $1 tn exports by 2030: CII","18":"IL&FS group to resolve ₹55,000 crore debt by March 2022","19":"Only 5 of 15 MSME technology centres completed since 2015: Govt data","20":"FPIs withdraw net ₹14,935 cr between Feb 1-11, turn sellers for 4th month","21":"LIC reserves up to 10% of issue size for policyholders in its IPO","22":"TVS Supply Chain files draft papers to raise funds via IPO","23":"Import duty on crude palm oil cut to 5.5% to cool edible oil prices","24":"SBI expects to recover ₹8,000 cr from written-off accounts in FY22","25":"What is RCB's full squad after IPL mega auction?","26":"Gujarat Titans, Lucknow Super Giants name their first-ever squads after IPL mega auction","27":"Hugh Edmeades returns to IPL mega auction for last session, gets standing ovation","28":"Who were the most expensive buys in the IPL 2022 mega auction?","29":"Who were the most expensive uncapped players in IPL mega auction?","30":"Which 5 players received the biggest salary hike after IPL mega auction?","31":"My father loved CSK, I wish he were alive to see this day: Hangargekar after ₹1.5 crore buy","32":"Which prominent players went unsold in the IPL mega auction?","33":"No team buys Suresh Raina in IPL mega auction","34":"Mumbai Indians name their squad after buying 21 players at IPL mega auction","35":"Arjun Tendulkar rejoins Mumbai Indians for ₹30 lakh","36":"How many players were bought in IPL 2022 mega auction and how much money was spent?","37":"How does CSK's squad look after IPL mega auction?","38":"MI really close to my heart, always wanted to play for them: Archer","39":"Remember going to see PBKS games, will be wearing their jersey now: Bawa","40":"DC's strategy is to back Indian bowlers in IPL 2022: Assistant coach Amre","41":"Rahane was value buy for us: Juhi Chawla's daughter Jahnavi Mehta","42":"When Archer is fit, he'll make formidable partnership with Bumrah: MI owner","43":"MI spent ₹23 cr on Kishan, Archer, made compromises to get them: Manjrekar","44":"Majority of things went as planned, we're happy with our squad: RCB's Hesson","45":"It'd be like Malinga, Bumrah together: Irfan Pathan on MI buying Archer","46":"Lone Indian athlete at Winter Olympics Arif finishes 45th in giant slalom","47":"CSK buy England pacer Jordan for ₹3.6 crore in IPL mega auction","48":"Dream come true: DC academy trainee Dhull to DC for buying him","49":"OnePlus to debut Nord CE 2 5G on February 17 in India","50":"IBM execs called older staff 'dinobabies', favoured millennials, emails reveal","51":"'ModifiedElephant' hacking group targeting Indian activists for 10 yrs: Report ","52":"Black Hawk helicopter flies for 1st time without a pilot in US; video surfaces","53":"Twitter down briefly as users around the world report outage","54":"McDonald's files trademarks for virtual restaurant featuring home delivery","55":"Indian researcher gets special mention by Google for reporting 232 bugs in 2021","56":"5G spectrum auction expected to be held in May: Telecom Secretary","57":"'Fun police' made us recall Tesla's 'Boombox' feature: Elon Musk","58":"China's Tencent denies buying more DiDi shares since US IPO","59":"India's internet economy likely to reach $1 trillion by 2030: Report","60":"US govt to depose senior Apple executives in Google antitrust case","61":"Billionaire Soros buys Amazon-backed EV startup Rivian shares for $2 bn","62":"NFT of a 4-bedroom house in Florida sells for over $654,000","63":"Apple sued over 'jelly scroll' defect on 6th gen iPad mini in US","64":"Ex-Amazon employee jailed for involvement in bribery scheme in US","65":"46-inch fully woven, smart display created by Cambridge scientists","66":"Musk's Neuralink allegedly subjected monkeys to 'extreme suffering'","67":"Starship launches to cost less than $10 mn each in 2-3 years: Musk","68":"Uber will accept cryptocurrencies at some point in the future: CEO","69":"Dyson accused of profiting from unlawful conditions at supplier firm","70":"Govt scraps requirement of drone pilot licence to operate drones","71":"Firm that sold Dorsey's 1st tweet NFT halts transactions over illegal acts","72":"Ford considering producing electric vehicles in India for export","73":"China censors lesbian plotline, sexually suggestive dialogues of 'Friends'","74":"Kanye shares alleged message from Kim's boyfriend Pete Davidson during Instagram rant","75":"Rapper Kodak Black was shot in leg outside Bieber concert after-party: Report","76":"Rakhi separates from Ritesh, says 'sad it's happening before Valentine's'","77":"Rapper Blueface arrested for owning concealed gun in US: Report","78":"I asked Bhansali 'Do you think I can do this': Alia on 'Gangubai Kathiawadi'","79":"'Fitoor' has been significant learning curve in my career: Abhishek","80":"Bravo: Ishaan Khatter on Ananya Panday's performance in 'Gehraiyaan'","81":"I don't want the pressure of lineage, legacy: Mithun's son Namashi","82":"Gave 4-5,000 auditions; sat home & cried, slapped myself: Aditya","83":"Melted my heart: Jennifer on Ben's early Valentine's Day present","84":"Maybe people don't care about Oscars, why should they? Seth Rogen","85":"Still from 'Brahmāstra' sets featuring Ranbir, Alia surfaces","86":"Shabana Azmi recovers from COVID-19, resumes work ","87":"Ivan Reitman, director of 1984 'Ghostbusters', passes away at 75","88":"Malayalam film 'The Great Indian Kitchen' to be remade in Hindi: Reports","89":"Not just Valentine's Day, every day special with husband: Shalmali","90":"Madhubala wasn't happy with Kishore Kumar, he'd no time for her: Actress' sister","91":"'Gehraiyaan' is a deeper look into modern relationships: Pavleen","92":"Andrew & I ate lunch facing wall to avoid Spider-Man spoiler: Charlie","93":"Berlin International Film Festival records 54 cases of COVID-19","94":"Moon Knight is loud and brutal: Marvel Studios President Kevin Feige","95":"Excited to celebrate our second Valentine's Day: Eijaz & Pavvitra","96":"Anubhav Sinha one of the finest filmmakers: Rajkummar on 'Bheed'","97":"I was pregnant: Neha Dhupia on playing pregnant cop in A Thursday"},"author":{"0":"Pragya Swastik","1":"Apaar Sharma","2":"Shalini Ojha","3":"Daisy Mowke","4":"Ridham Gambhir","5":"Arshiya Chopra","6":"Ridham Gambhir","7":"Pragya Swastik","8":"Pragya Swastik","9":"Hiral Goyal","10":"Pragya Swastik","11":"Anmol Sharma","12":"Sakshita Khosla","13":"Hiral Goyal","14":"Hiral Goyal","15":"Ashley Paul","16":"Hiral Goyal","17":"Ashley Paul","18":"Ashley Paul","19":"Ashley Paul","20":"Ashley Paul","21":"Ashley Paul","22":"Hiral Goyal","23":"Ashley Paul","24":"Ashley Paul","25":"Anmol Sharma","26":"Anmol Sharma","27":"Anmol Sharma","28":"Anmol Sharma","29":"Anmol Sharma","30":"Anmol Sharma","31":"Apaar Sharma","32":"Anmol Sharma","33":"Anmol Sharma","34":"Anmol Sharma","35":"Pragya Swastik","36":"Anmol Sharma","37":"Anmol Sharma","38":"Ankur Taliyan","39":"Anant Kaur","40":"Anant Kaur","41":"Ankur Taliyan","42":"Anant Kaur","43":"Anant Kaur","44":"Ankur Taliyan","45":"Ankur Taliyan","46":"Anant Kaur","47":"Anant Kaur","48":"Anant Kaur","49":"Roshan Gupta","50":"Hiral Goyal","51":"Pragya Swastik","52":"Ankush Verma","53":"Arshiya Chopra","54":"Hiral Goyal","55":"Hiral Goyal","56":"Hiral Goyal","57":"Hiral Goyal","58":"Aishwarya Awasthi","59":"Subhangi Singh","60":"Aishwarya Awasthi","61":"Aishwarya Awasthi","62":"Hiral Goyal","63":"Hiral Goyal","64":"Hiral Goyal","65":"Hiral Goyal","66":"Hiral Goyal","67":"Hiral Goyal","68":"Aishwarya Awasthi","69":"Aishwarya Awasthi","70":"Hiral Goyal","71":"Aishwarya Awasthi","72":"Hiral Goyal","73":"Sakshita Khosla","74":"Anmol Sharma","75":"Sakshita Khosla","76":"Sakshita Khosla","77":"Ramanpreet Singh Virdi ","78":"Ria Kapoor","79":"Amartya Sharma","80":"Amartya Sharma","81":"Kriti Kambiri","82":"Kriti Kambiri","83":"Amartya Sharma","84":"Kriti Kambiri","85":"Kriti Kambiri","86":"Udit Gupta","87":"Udit Gupta","88":"Udit Gupta","89":"Ramanpreet Singh Virdi ","90":"Udit Gupta","91":"Amartya Sharma","92":"Kriti Kambiri","93":"Amartya Sharma","94":"Amartya Sharma","95":"Ramanpreet Singh Virdi ","96":"Ramanpreet Singh Virdi ","97":"Kriti Kambiri"},"content":{"0":"State-run Life Insurance Corporation of India (LIC) on Sunday filed the Draft Red Herring Prospectus (DRHP) with capital markets regulator SEBI for an initial public offering (IPO). The IPO is expected to be the country's largest public issue. The LIC will offload over 31.62 crore shares of face value ₹10 each, according to the draft prospectus.\n","1":"Union Minister Piyush Goyal has shared a Shark Tank meme featuring Shaadi.com Founder Anupam Mittal to mock the Opposition. The minister informed that India added eight new unicorns in 40 days of 2022 and mocked the Opposition, saying it can't digest it. Reacting to the meme, Mittal tweeted, \"Piyush Goyal [It] appears like India is finally very Modivated.\"","2":"Former Congress chief Rahul Gandhi condoled the death of industrialist and former Chairman of Bajaj Group, Rahul Bajaj, on Saturday. \"We have lost a visionary whose courage made us proud,\" he tweeted. Dr Purvez K Grant, Chairman of Ruby Hall Clinic, where Bajaj passed away, said, \"He was under treatment for cardiac and lung-related problems for the last one month.\"","3":"Speaking on Figuring Out podcast, BharatPe Co-founder Ashneer Grover spoke about his \"brutal honesty\". \"I have to keep myself honest otherwise the market will kill you,\" he stated. \"In the last fours years whatever businesses I've made, these are multi-billion dollar businesses and it was possible because there's some level of honesty with yourself and with...your stakeholders,\" Ashneer added.","4":"A Class 8 girl became the youngest contestant to pitch her entrepreneurial idea for an anti-bullying app at Shark Tank India. A student of Pathways School Gurugram, 13-year-old Anoushka Jolly received funding of ₹50 lakh for her app 'KAVACH', which lets students and parents report incidents of bullying anonymously, thereby allowing concerned authorities to intervene in the matter.","5":"Several Bajrang Dal members staged protests at outlets and showrooms of KFC, Pizza Hut, Hyundai and Kia in Gujarat days after their Pakistani distributors' posts on Kashmir. Hundreds of posters reading 'Bharat Mata Ki Jai' were also put up at the outlets. \"Kashmir, including PoK, is an integral part of India,\" the posters read.","6":"Air India on Sunday issued a new advisory for its cabin crew in a bid to improve the airlines’ performance. The new advisory asked the cabin crew to wear minimum jewellery \"to avoid any delays at customs and security checks.\" It also asked them to not visit duty-free shops and to proceed to the gates after security checks. ","7":"The CBI in its biggest bank fraud case booked Mumbai-based ABG Shipyard, its directors and ex-Chairman Rishi Kamlesh Agarwal for allegedly defrauding 28 banks, including SBI, of ₹22,842 crore. The company's loan account became an NPA in 2013. An E&Y forensic audit report in 2019 identified fraud and attributed it to diversion of funds, misappropriation and criminal breach of trust.","8":"Industrialist Rahul Bajaj, the late Chairman Emeritus of Bajaj Auto, was cremated with full state honours in Maharashtra's Pune on Sunday. The last rites of the Padma Bhushan-awardee, who passed away at 83 on Saturday, were performed by his sons Rajiv Bajaj and Sanjiv Bajaj. Rahul Bajaj breathed his last in a Pune hospital on Saturday due to illness.","9":"RPG Enterprises Chairman Harsh Goenka described the demise of industrialist and Padma Bhushan awardee Rahul Bajaj as the cracking of the \"spine\" of Indian business. \"A close family friend, he was a visionary, straight talking and very respected for his value systems,\" he said. \"He leaves behind the two most capable sons in Indian industry, Rajiv and Sanjiv,\" Goenka added.","10":"Bajaj Auto MD Rajiv Bajaj, the son of industrialist Rahul Bajaj, paid tribute to his father in a WhatsApp status that read, \"All men die, not all men truly live,\" Moneycontrol reported. Padma Bhushan awardee Rahul Bajaj passed away at the age of 83 on Saturday. He was cremated with full state honours in Pune on Sunday.","11":"Indian equity benchmark Sensex fell by more than 1,400 points to around 56,732 and the Nifty slipped below the 17,000-mark. All the stocks were in the red zone on the Sensex-30 shares barring TCS. The BSE Midcap and Smallcap indices were also in red. ICICI Bank, SBI, Tata Steel and L&T shares tanked more than 3%.","12":"Ex-NSE CEO Chitra Ramkrishna, who's been fined ₹3 crore for violating securities contract rules, was guided by an unknown Himalayan 'yogi' she had never met, SEBI said. Ramkrishna consulted him for employee appointments, appraisals and shared NSE data with him, SEBI said. She told SEBI he was a \"spiritual force that could manifest itself anywhere...didn't have any physical...co-ordinates\".","13":"Telecom Secretary K Rajaraman told PTI the 5G spectrum auction is expected to be held in May this year. \"Telecom Regulatory Authority of India has indicated that they will send it (recommendations on rules regarding the sale process) by March,\" Rajaraman said. He added that it will take the department two months to start the auction after getting those recommendations.","14":"The Competition Commission of India (CCI) has received certain complaints against e-commerce companies alleging predatory pricing but it has not found any company guilty so far, Minister of State for Commerce and Industry, Som Parkash, said. \"Imposition of unfair or discriminatory prices...by a dominant enterprise or group is prohibited under provisions of...Competition Act, 2002,\" he added.","15":"The Union Home Ministry has approved the continuation of the Modernisation of State Police Forces scheme for five years up to 2025-26 with an outlay of ₹26,275 crore. The Ministry said the scheme includes security-related expenditure in Jammu and Kashmir, northeastern states and Maoists-affected areas. The scheme also aims to raise new battalions and develop high-tech forensic labs.","16":"Life Insurance Corporation of India (LIC) on Sunday filed the draft red herring prospectus (DRHP) with SEBI for an IPO. The draft papers revealed that LIC's embedded value stood at ₹5,39,686 crore as on September 30, 2021. The embedded value of a life insurance company represents the sum of present value of future profits and the net value of assets.","17":"A report by Confederation of Indian Industry (CII) said India needs to adopt a multidimensional approach to take the country's merchandise exports to $1 trillion by 2030. The CII report recommends finalising free trade agreements, attracting global firms and addressing domestic manufacturing issues to achieve the target. It added that India needs to integrate closely with global value chains.","18":"Infrastructure Leasing & Financial Services (IL&FS) group would resolve debt of ₹55,000 crore by March 2022, the company's board stated in its affidavit filed before the National Company Law Appellate Tribunal (NCLAT). Led by Kotak Mahindra Bank's CEO Uday Kotak, the bank's board said the debt would be resolved through asset monetisation, restructuring and insolvency proceeding initiatives.","19":"Only 5 out of 15 proposed MSME technology centres (TCs) have been completed in the last seven years, government data showed. The TCs were proposed under the Technology Centre Systems Programme (TCSP) and were due to be completed by 2020-21. Work at five TCs at Bhiwadi (Rajasthan), Pudi (Andhra Pradesh), Bhopal (Madhya Pradesh), Rohtak (Haryana) and Puducherry was completed.","20":"Foreign portfolio investors (FPIs) withdrew a net ₹14,935 crore between February 1 and February 11 and have been net sellers for the fourth consecutive month. As per data from depositories, FPIs took out ₹10,080 crore from equities and ₹4,830 crore from the debt segment. This comes after US retail inflation recorded its biggest rise in 40 years at 7.5%.","21":"Life Insurance Corporation of India (LIC) has decided to reserve a maximum of 10% and 5% of its IPO issue size of 31.6 crore shares for policyholders and employees respectively. The quantum of discount on the share price will be announced later. Policyholders who fail to update their PAN details by February 28 will not be eligible for this quota.","22":"Chennai-based logistics firm TVS Supply Chain Solutions has filed a draft red herring prospectus (DRHP) with the SEBI seeking approval to raise funds through an IPO. The offer comprises a fresh issue of ₹2,000 crore and an offer for sale of 5.94 crore shares. The company plans to use part of the IPO proceeds to repay some of its debt.","23":"Central Board of Indirect Taxes and Customs (CBIC) reduced the effective duty on crude palm oil import from 8.25% to 5.5%. CBIC aims to control cooking oil prices and support domestic processing companies with this move. Effective from Sunday, CBIC has cut agri infra development cess to 5% and extended reduced import duty on crude oils by six months.","24":"State Bank of India (SBI) is expecting to recover around ₹8,000 crore from written-off accounts, including from National Company Law Tribunal (NCLT) resolved cases, in FY22. During the October-December quarter, SBI recovered ₹1,500 crore while between April-December 2021, it recovered ₹5,600 crore, SBI said. The bank's non-performing assets dropped from 4.9% in Q2 FY22 to 4.5% in Q3 FY22.","25":"Royal Challengers Bangalore (RCB) have a total of 22 squad members after the conclusion of IPL mega auction. Dinesh Karthik will be representing the side after seven years. Faf du Plessis, who represented CSK in nine seasons, will also don RCB colours in IPL 2022. The squad also includes Wanindu Hasaranga and Josh Hazlewood.","26":"Gujarat Titans (GT) and Lucknow Super Giants (LSG), who will be making their debut in IPL 2022, named their squads on Twitter following the IPL 2022 mega auction. Hardik Pandya-led GT have 23 members in their squad, while KL Rahul-led LSG have 21 players. LSG bought Quinton De Kock and Krunal Pandya among others, while GT's signings include Lockie Ferguson.","27":"Auctioneer Hugh Edmeades, who fell off the stage due to Postural Hypotension and was replaced by Charu Sharma at the IPL mega auction on Saturday, returned to the event for the last session today. He was welcomed by franchise officials and others in auction room with a standing ovation. \"Slightly disappointed they haven't put in a railing here,\" he joked.","28":"Wicketkeeper-batter Ishan Kishan was the most expensive buy at the IPL 2022 mega auction after being bought by MI for ₹15.25 crore. CSK spent ₹14 crore on fast bowler Deepak Chahar, making him the second-most expensive buy in the mega auction. The third-most expensive buy was Shreyas Iyer, who was bought by KKR for ₹12.25 crore.","29":"Pacer Avesh Khan became the most expensive uncapped player in IPL history after being bought by LSG for ₹10 crore in IPL 2022 mega auction. All-rounders Shahrukh Khan and Rahul Tewatia were the joint second-most expensive uncapped players, being bought for ₹9 crore each by PBKS and GT respectively. Rahul Tripathi was bought by SRH for ₹8.50 crore.","30":"Five players saw their previous IPL salary rise by 2000% and more after mega auction. Harshal Patel, who was bought by RCB for ₹10.75 crore, received a salary hike of 5275%. Prasidh Krishna, who earned ₹20 lakh in 2021, will get ₹10 crore. Tim David, Devdutt Padikkal and Wanindu Hasaranga received a salary hike of 4025%, 3775% and 2050% respectively.","31":"After Rajvardhan Hangargekar was bought by CSK for ₹1.5 crore, the 19-year-old all-rounder said, \"My father just loved CSK and used to follow them passionately. I wish he were alive to see this day.\" Hangargekar's father died due to COVID-19 in 2020. Hangargekar's coach Mohan Jadhav said, \"I have seen him grow as a person since he lost his father.\"","32":"As many as 34 cricketers having the base price of at least ₹1 crore went unsold in the IPL 2022 mega auction. Australia limited-overs captain Aaron Finch, who has represented eight IPL teams, went unsold. Other prominent players who went unsold include Steve Smith, Shakib Al Hasan, Adil Rashid, Imran Tahir, Suresh Raina, Ishant Sharma and Eoin Morgan.","33":"Suresh Raina will not feature in IPL 2022 after going unsold in IPL mega auction. The 35-year-old, who had a base price of ₹2 crore, had gone unsold on the first day of the auction on Saturday. On Sunday, he was not included in the final list of the second acceleration round. Raina scored 5,528 runs in 205 IPL matches.","34":"Five-time IPL champions Mumbai Indians took their squad strength to 25 after buying 21 cricketers at the mega auction. The squad, led by Rohit Sharma, includes Ishan Kishan, Dewald Brevis, Jaydev Unadkat, Mayank Markande, Jofra Archer and Tymal Mills, among others. Mumbai Indians also reacquired Arjun Tendulkar after buying him for ₹30 lakh.","35":"Former cricketer Sachin Tendulkar's 22-year-old son Arjun Tendulkar rejoined Mumbai Indians (MI) for ₹30 lakh in the IPL auction on Sunday. The left-arm pacer was part of Mumbai Indians in IPL 2021 too. Arjun was among the players shortlisted for the accelerated auction and Mumbai Indians and Gujarat Titans had bid for him.","36":"The 10 IPL franchises spent ₹551.7 crore in the two-day IPL 2022 mega auction in Bengaluru to buy a total of 204 players. As many as 11 players were bought for at least ₹10 crore each, while 13 players were bought for amount between ₹8 crore and ₹9.25 crore. In 2018 mega auction, ₹432 crore was spent on 169 players.","37":"CSK took their squad strength to 25 players, including eight overseas players, after the IPL 2022 mega auction. CSK will be without Suresh Raina, who went unsold in the mega auction. Devon Conway, Adam Milne and Dwayne Bravo are among CSK's overseas players. Rajvardhan Hangargekar, who was a part of India's 2022 Under-19 World Cup-winning squad, will also represent CSK.","38":"On being bought by MI for ₹8 crore in the IPL mega auction, England pacer Jofra Archer said, \"I'm super excited to be joining [the franchise].\" He added, \"It has been a franchise that was really close to my heart and I always wanted to play for them.\" Archer is unlikely to play this season due to his elbow injury. ","39":"After being bought by Punjab Kings in IPL mega auction 2022 for ₹2 crore, India Under-19 all-rounder Raj Bawa said he's excited to be given a chance in the franchise. \"It's been my favourite team for a long time. I remember going to see their games right after practice in...evening and I'll be wearing a PBKS jersey now,\" he added.","40":"Reflecting on Delhi Capitals' buys in IPL 2022 mega auction, assistant coach Pravin Amre said team's strategy is to back Indian bowlers in IPL 2022 as with South Africa pacer Anrich Nortje in the squad they can use several other combinations. \"We will get these options of combinations with a left-arm seamer like Chetan Sakariya and Khaleel Ahmed,\" he added.","41":"KKR co-owner Juhi Chawla's daughter Jahnavi Mehta, who attended the IPL mega auction, has said that Ajinkya Rahane was a \"value buy\" for them as he'll add a lot in terms of leadership in the team. \"Rahane will allow Venkatesh Iyer to play his role and would be the perfect foil,\" she added. KKR bought Rahane for ₹1 crore. ","42":"Explaining the reason why Mumbai Indians bought Jofra Archer in IPL mega auction 2022 despite his possible non-availability in IPL 2022, owner Akash Ambani said when England pacer is fit and available, he'll make a formidable partnership with Jasprit Bumrah. Archer is currently recovering from an elbow injury. The 26-year-old was bought by MI for ₹8 crore.","43":"Commentator Sanjay Manjrekar said Mumbai Indians made \"a lot of compromises\" to buy Ishan Kishan and Jofra Archer in IPL mega auction 2022. He added that MI was \"bailing out\" in auction after spending ₹23 crore on them. Kishan was bought for ₹15.25 crore, becoming the second most expensive Indian buy in IPL history. Archer was picked for ₹8 crore.","44":"RCB's Director of Cricket Mike Hesson has said the majority of things went as planned in the IPL 2022 mega auction and they are happy with the way their squad has shaped. \"It's a balanced team of overseas and domestic players. We've managed to cover all our bases,\" he added. RCB have a total of 22 squad members. ","45":"Former India all-rounder Irfan Pathan has termed the buying of Jofra Archer as a \"masterstroke\" by MI at the IPL mega auction. \"Even if Archer doesn't play for one year, they will have Bumrah and Archer bowling together [in 2023]. It would be like Lasith Malinga and Jasprit Bumrah bowling together [again] for the franchise,\" Pathan added. ","46":"India's lone participant at 2022 Beijing Winter Olympics alpine skier Arif Khan finished 45th in men's giant slalom on Sunday. The 31-year-old clocked a combined time of 2 minute 47.24 seconds from two races, finishing 37.89 seconds behind gold medallist Marco Odermatt of Switzerland who clocked a combined time of 2:09.35. Notably, it's India's best ever performance in giant slalom.","47":"England pacer Chris Jordan was bought by Chennai Super Kings for ₹3.6 crore on day two of IPL mega auction 2022 on Sunday. Royal Challengers Bangalore opened the bidding for Jordan before CSK outbid them. He had a base price of ₹2 crore. Jordan represented Punjab Kings in last two seasons of IPL. He played four matches in IPL 2021.","48":"Expressing gratitude towards Delhi Capitals for picking him in IPL mega auction 2022, India's 2022 Under-19 World Cup-winning skipper Yash Dhull said it's a dream come true for him. \"Thank you for showing faith in me...I've been...part of Delhi Capitals Bal Bhavan Academy for eight-nine years...I'm really excited to join the team,\" he added. Dhull was signed for ₹50 lakh.\n","49":"OnePlus has announced the launch of the OnePlus Nord CE 2 5G on February 17 in India. The smartphone will feature MediaTek Dimensity 900 Chipset and will support 65W SUPERVOOC fast charging. Reportedly, the OnePlus Nord CE 2 5G will sport a triple camera sensor on the back along with a punch-hole camera on the top-left.","50":"IBM executives discussed how to force out older employees and called them \"dinobabies\" who should be made an \"extinct species\", Bloomberg reported quoting emails revealed in a court filing. The officials expressed frustration over the company having a much lower share of millennials in its workforce than a competitor. IBM is facing age bias complaints by former employees in US.","51":"US-based cybersecurity firm SentinelOne claims that 'ModifiedElephant' hacking group, operating since at least 2012, is responsible for targeted attacks on human rights activists, academics, journalists and lawyers in India. It was reportedly used to plant incriminating digital evidence on people's devices. SentinelOne also said it targeted activists arrested in the Bhima Koregaon case of 2018.","52":"A Black Hawk helicopter took its first flight without a pilot in US, with a video of the aircraft surfacing online. The helicopter flew for 30 minutes without any passengers on board first on February 5 and again on Monday, according to US Department of Defence's research arm. The helicopter had Sikorsky MATRIX autonomous technology installed in it.","53":"Twitter Inc's website and app were down briefly for users on Friday, with thousands of people taking to social media sites to report outage. The website Downdetector shows an outage for Twitter and suggests that users have been facing issues since 11 pm. The reason for the outage is yet to be ascertained.","54":"McDonald's has filed trademarks with the United States Patent and Trademark Office (USPTO) to open a virtual restaurant that will deliver food online and in-person. The filings aim to trademark \"operating a virtual restaurant featuring actual and virtual goods\" and home delivery. The company has also trademarked providing entertainment services, including \"online actual and virtual concerts\".","55":"Google has given a special mention to Indian researcher Aman Pandey in its 'Vulnerability Reward Program: 2021 Year in Review' for submitting 232 vulnerabilities during the year. Google called Aman their top researcher and said, \"He has been a crucial part of making our program so successful.\" Aman has reported more than 280 valid Android vulnerabilities since 2019.","56":"Telecom Secretary K Rajaraman told PTI the 5G spectrum auction is expected to be held in May this year. \"Telecom Regulatory Authority of India has indicated that they will send it (recommendations on rules regarding the sale process) by March,\" Rajaraman said. He added that it will take the department two months to start the auction after getting those recommendations.","57":"After a Twitter user questioned the rationale behind Tesla recalling the 'Boombox' feature, which enables people to play sounds over an external speaker, Tesla CEO Elon Musk said, \"The fun police made us do it.\" He was apparently referring to the US National Highway Traffic Safety Administration, which had expressed concerns over the 'Boombox' feature obscuring audible warnings for pedestrians.","58":"China's Tencent has denied buying more shares in DiDi Global since it went public in the US. This comes after a US regulatory filing showing an increased stake sent Tencent shares soaring almost 9%. It had added about 1.8 million DiDi Class A ordinary shares to its last-known holdings during DiDi's IPO. As of December, Tencent owned 78.85 million shares.","59":"India's internet economy is surging by over 50% year over year and may reach $1 trillion by 2030, a report by consulting firm RedSeer said. The internet economy includes sectors like e-tailing, e-health, food tech, online mobility and quick commerce. ''In just 2021, more than $40 billion of funding and 42 new unicorns were born,'' RedSeer CEO Anil Kumar said. ","60":"The US DOJ is asking for depositions of \"Apple's most senior executives\" in its antitrust case against Google. The agency has accused Google of paying billions of dollars each year in exclusionary agreements with Apple, Samsung and others in order to make its search engine the default on their devices. The US Justice Department sued Google in October 2020.","61":"Billionaire investor George Soros bought nearly 20 million shares of Amazon-backed EV startup Rivian in the December-quarter, filings revealed. The shares were worth about $2 billion at the time. Rivian, which is 20% owned by Amazon, is yet to produce a consumer vehicle. Shares of Rivian fell 9% on Friday and are down 43% for the year to date.","62":"An NFT (non-fungible token) of a four-bedroom house in Florida's Gulfport was auctioned for more than $654,000. The buyer will receive a token which is linked to a US-based entity that owns the rights to the 2,162 square feet property. Propy, the entity that minted the rights into token, claimed it is the first real estate NFT auction in US.","63":"Apple is facing a class-action lawsuit in the US over the 'jelly scroll' defect on its 6th generation iPad mini. The defect makes it seem like one half of the display is responding at a faster rate than the other. Days after the launch of iPad mini in 2021, Apple had acknowledged the issue and said it's normal LCD behaviour.","64":"A former Amazon employee has been sentenced to 10 months in prison for his involvement in a bribery scheme aimed at manipulating Amazon's marketplace. Rohit Kadimisetty used \"inside knowledge to recruit employees in India to misuse their employee privileges\", the US Justice Department said. He stole confidential business information about Amazon algorithms and reinstated suspended accounts.","65":"University of Cambridge-led researchers have created a 46-inch fully woven, textile display with smart sensors, energy harvesting and storage functionalities integrated into the fabric. It can operate as a display, monitor various inputs or store energy for later use. Researchers said this could lead to curtains that are also TVs, energy-harvesting carpets, and interactive, self-powered clothing.","66":"US-based animal-rights group has accused researchers at Neuralink and University of California, Davis, of subjecting monkeys to \"extreme suffering\" while testing brain implants on them. \"Monkeys used in experiment were caged alone, had steel posts screwed to their skulls, suffered \"facial trauma\",\" it said. Billionaire Elon Musk-led Neuralink is preparing to launch clinical trials in humans soon.","67":"SpaceX's billionaire CEO Elon Musk said the company's Starship rockets will cost less than $10 million per launch within 2-3 years. \"It may be as little as a few million dollars per flight...These are crazy low numbers by space standards,\" he added. The 394-feet tall reusable spacecraft is designed to carry both crew and cargo on long-duration interplanetary flights.","68":"Uber CEO Dara Khosrowshahi in an interview revealed that the ride-hailing firm will accept cryptocurrencies for payments \"at some point\" in the future. \"This isn't the right point,\" he said. \"As the exchange mechanism becomes less expensive and becomes more environmentally friendly, I think you will see us leaning into crypto a little bit more,\" Khosrowshahi added.","69":"Ten former workers of Malaysian firm ATA IMS, Dyson's parts supplier, have claimed Dyson \"unjustly\" benefitted from \"unlawful\" and \"exploitative\" conditions at ATA's factory. \"These allegations relate to employees of ATA...If proceedings were to be issued we would robustly defend them,\" Dyson said. It added that it takes its responsibilities towards workers of suppliers \"extremely seriously\".","70":"The Ministry of Civil Aviation said on Saturday that the requirement of a drone pilot licence to fly drones in the country has been abolished with effect from February 11, 2022. \"The Remote Pilot Certificate (RPC) issued by a DGCA-approved drone school through the single window DigitalSky Platform shall be sufficient for operating a drone in India,\" the ministry added.","71":"US-based Cent, which sold an NFT of Jack Dorsey's first tweet, has halted transactions due to illegal activities by users. \"There's a spectrum of activity that is happening that basically shouldn't be happening, like, legally,\" CEO Cameron Hejazi said. Hejazi said people are selling unauthorised copies of other NFTs or making NFTs of content that does not belong to them.","72":"Ford told Reuters it is exploring the possibility of using a plant in India to produce electric vehicles (EVs) for export. In September 2021, Ford announced it would cease local manufacturing in India, citing an operating loss of $2 billion over the past 10 years. The US-based automaker may also consider selling electric cars in India, its spokesman said.","73":"Fans of the American TV show 'Friends' have complained of censorship in some episodes that were re-released on several Chinese streaming websites. As per reports, in the censored version, the plotline of Ross' lesbian ex-wife has been removed. Viewers also alleged that a dialogue referencing \"multiple orgasms\" was translated as \"women have endless gossips\" in the Chinese subtitles.","74":"Rapper Kanye 'Ye' West shared multiple posts on Instagram about his estranged wife Kim Kardashian's boyfriend Pete Davidson. Kanye called the comedian \"a d****head\" and also shared a screenshot of an alleged message from Pete. The message included a supposed promise by Pete to not get in the middle of how Kanye and Kim wanted to raise their kids.","75":"Rapper Kodak Black was among those injured in the shooting outside a Los Angeles restaurant hosting a Justin Bieber concert after-party, reports have said. Black, whose legal name is Bill Kapri, was shot in the leg, TMZ reported. Videos have reportedly shown Black posing for photos outside the restaurant when a brawl broke out.","76":"Rakhi Sawant has announced that she's separating from her husband Ritesh Singh after appearing with him on Bigg Boss 15. Saying that \"a lot has happened\" after the show, Rakhi said, \"We've tried to work out our differences...but I think it's best we both move on amicably...I'm really sad and heartbroken that this had to happen before Valentine's Day.\"","77":"American rapper Blueface was recently arrested for possessing a concealed firearm in Hollywood, a report said. Blueface was stopped on Sunset Boulevard around 3.15 am as he drove a car with an expired registration. He was also driving with a suspended licence. Upon search, a loaded handgun was recovered from his vehicle, the report said.","78":"While speaking about her upcoming film 'Gangubai Kathiawadi', actress Alia Bhatt said she \"wasn't expecting such film\". \"I was scared...asked sir everything I feared: Do you think I can do this? Don't you think I am little young? He said, 'I will make you do it'...I told myself there should be no scope of doubt in my head,\" Alia said.","79":"Director Abhishek Kapoor has said that his 2016 film 'Fitoor' has been a \"significant learning curve\" in his career as he talked about complex characters and reimagined the tale in a contemporary setting. The film was based on Charles Dickens' novel 'Great Expectations'. \"The entire cast and crew...helped me realise this immaculate world where time stands still,\" the filmmaker added.","80":"Actor Ishaan Khatter took to Instagram Stories to praise rumoured girlfriend Ananya Panday's performance in her film 'Gehraiyaan'. In a post shared by Ananya, the actress said that playing Tia in the film was a treat. He shared the post of Ananya on his story and used a sticker that read \"Bravo\". 'Gehraiyaan' began streaming on February 11.","81":"Veteran actor Mithun Chakraborty's son Namashi has stated that he doesn't want the pressure of his lineage and legacy on his career. Namashi added that his father said he won't launch him and he'd have to figure out his first film himself. \"Dad knew that if I get a readymade launchpad, I'll become...lazy and won't grow,\" the actor said.","82":"Television actor Aditya Dekhmukh has called 2017 the worst year of his life, saying that he gave more than four-five thousand auditions but was still sitting at home for eight months. \"I used to wonder what's happening in my life...I used to cry, slap myself,\" the actor added. Aditya further said that he would watch movies as a distraction. ","83":"Singer-actress Jennifer Lopez said her boyfriend and actor Ben Affleck gifted her a remixed version of her song 'On My Way', which was made by him, as an \"early Valentine's Day present\". The remixed version contained pictures and videos of the couple. \"Watching it made me think about the journey of true love...This seriously melted my heart,\" she stated.","84":"Comedian Seth Rogen in an interview has stated that maybe people don't care about the Oscars anymore, adding, \"And why should they?\" The 2021 Oscars had the lowest viewership recorded since 1974 with 10.4 million viewers. \"I don't care who wins the automobile awards. No other industry expects everyone to care about what awards they shower upon themselves,\" Seth said.","85":"A still from the sets of upcoming superhero film 'Brahmāstra' has surfaced on the internet which shows actors Ranbir Kapoor and Alia Bhatt looking at each other through a gate. 'Brahmāstra', which was announced by filmmaker Karan Johar in October 2017, has been filming for nearly four years. The film also stars veteran actors Amitabh Bachchan, Dimple Kapadia and Nagarjuna.","86":"Veteran actress Shabana Azmi, who contracted COVID-19 earlier this month, has tested negative for the virus. Taking to Instagram, she shared a picture of herself and wrote, \"Free from COVID finally and back on set - the place I'm happiest to be in.\" Shabana will be seen in Karan Johar's 'Rocky Aur Rani Ki Prem Kahani'.","87":"\nIvan Reitman, the director of 1984 film 'Ghostbusters', has passed away at the age of 75. While the cause of his death hasn't been revealed, his family said he died peacefully in his sleep on Saturday night at his home in Montecito, California. The Canadian-American filmmaker also produced 'National Lampoon's Animal House' and 'Up in the Air'. ","88":"Malayalam film 'The Great Indian Kitchen', starring Nimisha Sajayan and Suraj Venjaramoodu, will be remade in Hindi by producers Harman Baweja and Vicky Bahri, as per reports. \"The prep work has started as the team is working closely to adapt the story as per Hindi sensibilities,\" Pinkvilla said quoting a source. The remake will reportedly be directed by Arati Kadav.\n","89":"Singer and composer Shalmali has said she and her husband Farhan Shaikh don't need Valentine's Day to celebrate their love. \"For me, every day with this human being [Farhan] is just so exciting and special,\" Shalmali said. \"We keep doing these little things for each other, so...Valentine's Day doesn't need any particular attention,\" Shalmali added. ","90":"Madhubala's younger sister Madhur Bhushan opened up on the actress' marriage with Kishore Kumar and revealed that she wasn't happy with him. She added that the singer was very busy with his recordings and \"had no time\" for her. \"On the other hand, Madhubala had been told by...doctors...she'd only two years to live...She cried a lot in loneliness,\" Madhur said. ","91":"Talking about 'Gehraiyaan', actress Pavleen Gujral said, \"It's a deeper look into modern relationships and how your past somehow never leaves you and it changes you as a person.\" Gujral portrayed the mother of Deepika Padukone's character in the film. \"It's a very important film for today's generation who want to get over the past and move on,\" she added.","92":"Actor Charlie Cox has revealed that he once ate lunch with Andrew Garfield while facing the wall to avoid giving spoilers of their cameos in 'Spider-Man: No Way Home'. \"While we were sitting down, it occurred to both of us...'If we're filmed here together, that's not a good sign',\" he said. Charlie portrayed Matt Murdock while Andrew played Spider-Man.","93":"Berlin International Film Festival, which began on February 10, has recorded 54 cases of COVID-19. \"Since the beginning of the festival, we have...detected eight cases of positive tests among the film teams,\" a spokesperson told Deadline. \"The Berlinale's test buses, available for both accredited and audience, did approximately 2,700 tests and had...54 positive tests,\" the spokesperson added. ","94":"Talking about Marvel's upcoming series 'Moon Knight', Marvel Studios President Kevin Feige said, \"There are moments [in the series] when Moon Knight is wailing on another character, and it is loud and brutal.\" Feige further added that \"there's a tonal shift\" in the MCU with 'Moon Knight'. Actor Oscar Isaac will portray the role of Moon Knight in the series. ","95":"Actors Eijaz Khan and Pavvitra Punia have said they are excited to celebrate their second Valentine's Day together. \"If one particular day gives me a chance to do something special for my loved one and bring a smile to her face, why not?\" Eijaz said. \"It is a special day and one should celebrate it,\" said Pavvitra. ","96":"Actor Rajkummar Rao has said he was waiting to collaborate with director Anubhav Sinha, with whom he is working in 'Bheed'. \"He is one of the finest filmmakers we have. After working, we have become good friends. It is...special to us,\" Rajkummar said. The shooting of the film, which is being billed as a social drama, concluded in December.","97":"Actress Neha Dhupia has said that she was actually pregnant while shooting 'A Thursday' in which she portrays a pregnant policewoman and didn't need to work much on her physicality. \"I always kept the reference point more towards being the cop and less towards my physicality changing,\" Neha said. She added they didn't go over the top with the pregnancy."},"date":{"0":"13 Feb 2022,Sunday","1":"13 Feb 2022,Sunday","2":"12 Feb 2022,Saturday","3":"12 Feb 2022,Saturday","4":"13 Feb 2022,Sunday","5":"12 Feb 2022,Saturday","6":"13 Feb 2022,Sunday","7":"13 Feb 2022,Sunday","8":"13 Feb 2022,Sunday","9":"12 Feb 2022,Saturday","10":"13 Feb 2022,Sunday","11":"14 Feb 2022,Monday","12":"12 Feb 2022,Saturday","13":"13 Feb 2022,Sunday","14":"13 Feb 2022,Sunday","15":"13 Feb 2022,Sunday","16":"13 Feb 2022,Sunday","17":"13 Feb 2022,Sunday","18":"13 Feb 2022,Sunday","19":"13 Feb 2022,Sunday","20":"13 Feb 2022,Sunday","21":"13 Feb 2022,Sunday","22":"13 Feb 2022,Sunday","23":"13 Feb 2022,Sunday","24":"13 Feb 2022,Sunday","25":"14 Feb 2022,Monday","26":"13 Feb 2022,Sunday","27":"13 Feb 2022,Sunday","28":"13 Feb 2022,Sunday","29":"13 Feb 2022,Sunday","30":"14 Feb 2022,Monday","31":"14 Feb 2022,Monday","32":"13 Feb 2022,Sunday","33":"13 Feb 2022,Sunday","34":"14 Feb 2022,Monday","35":"13 Feb 2022,Sunday","36":"13 Feb 2022,Sunday","37":"14 Feb 2022,Monday","38":"14 Feb 2022,Monday","39":"13 Feb 2022,Sunday","40":"13 Feb 2022,Sunday","41":"14 Feb 2022,Monday","42":"13 Feb 2022,Sunday","43":"13 Feb 2022,Sunday","44":"14 Feb 2022,Monday","45":"14 Feb 2022,Monday","46":"13 Feb 2022,Sunday","47":"13 Feb 2022,Sunday","48":"13 Feb 2022,Sunday","49":"11 Feb 2022,Friday","50":"12 Feb 2022,Saturday","51":"13 Feb 2022,Sunday","52":"12 Feb 2022,Saturday","53":"11 Feb 2022,Friday","54":"11 Feb 2022,Friday","55":"13 Feb 2022,Sunday","56":"13 Feb 2022,Sunday","57":"13 Feb 2022,Sunday","58":"11 Feb 2022,Friday","59":"11 Feb 2022,Friday","60":"12 Feb 2022,Saturday","61":"12 Feb 2022,Saturday","62":"13 Feb 2022,Sunday","63":"13 Feb 2022,Sunday","64":"13 Feb 2022,Sunday","65":"14 Feb 2022,Monday","66":"11 Feb 2022,Friday","67":"11 Feb 2022,Friday","68":"12 Feb 2022,Saturday","69":"12 Feb 2022,Saturday","70":"12 Feb 2022,Saturday","71":"12 Feb 2022,Saturday","72":"11 Feb 2022,Friday","73":"13 Feb 2022,Sunday","74":"14 Feb 2022,Monday","75":"13 Feb 2022,Sunday","76":"13 Feb 2022,Sunday","77":"13 Feb 2022,Sunday","78":"14 Feb 2022,Monday","79":"13 Feb 2022,Sunday","80":"13 Feb 2022,Sunday","81":"13 Feb 2022,Sunday","82":"13 Feb 2022,Sunday","83":"13 Feb 2022,Sunday","84":"13 Feb 2022,Sunday","85":"13 Feb 2022,Sunday","86":"14 Feb 2022,Monday","87":"14 Feb 2022,Monday","88":"14 Feb 2022,Monday","89":"13 Feb 2022,Sunday","90":"14 Feb 2022,Monday","91":"13 Feb 2022,Sunday","92":"13 Feb 2022,Sunday","93":"13 Feb 2022,Sunday","94":"13 Feb 2022,Sunday","95":"13 Feb 2022,Sunday","96":"13 Feb 2022,Sunday","97":"13 Feb 2022,Sunday"},"category":{"0":"business","1":"business","2":"business","3":"business","4":"business","5":"business","6":"business","7":"business","8":"business","9":"business","10":"business","11":"business","12":"business","13":"business","14":"business","15":"business","16":"business","17":"business","18":"business","19":"business","20":"business","21":"business","22":"business","23":"business","24":"business","25":"sports","26":"sports","27":"sports","28":"sports","29":"sports","30":"sports","31":"sports","32":"sports","33":"sports","34":"sports","35":"sports","36":"sports","37":"sports","38":"sports","39":"sports","40":"sports","41":"sports","42":"sports","43":"sports","44":"sports","45":"sports","46":"sports","47":"sports","48":"sports","49":"technology","50":"technology","51":"technology","52":"technology","53":"technology","54":"technology","55":"technology","56":"technology","57":"technology","58":"technology","59":"technology","60":"technology","61":"technology","62":"technology","63":"technology","64":"technology","65":"technology","66":"technology","67":"technology","68":"technology","69":"technology","70":"technology","71":"technology","72":"technology","73":"entertainment","74":"entertainment","75":"entertainment","76":"entertainment","77":"entertainment","78":"entertainment","79":"entertainment","80":"entertainment","81":"entertainment","82":"entertainment","83":"entertainment","84":"entertainment","85":"entertainment","86":"entertainment","87":"entertainment","88":"entertainment","89":"entertainment","90":"entertainment","91":"entertainment","92":"entertainment","93":"entertainment","94":"entertainment","95":"entertainment","96":"entertainment","97":"entertainment"}}